Repository: Porabuild/Poracode
Catalog: ios/App/App/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pl, pt_br, ru, tr, uk, vi, zh_hans

# rich_chat_request_uncertain
source: The connection ended before the desktop confirmed the change. Refresh before trying again.
de: Die Verbindung wurde beendet, bevor der Desktop die Änderung bestätigt hat. Aktualisiere vor einem erneuten Versuch.
es: La conexión terminó antes de que el escritorio confirmara el cambio. Actualiza antes de intentarlo de nuevo.
fr: La connexion s’est interrompue avant la confirmation de la modification. Actualisez avant de réessayer.
ja: デスクトップが変更を確認する前に接続が終了しました。再試行する前に更新してください。
ko: 데스크톱이 변경을 확인하기 전에 연결이 종료되었습니다. 다시 시도하기 전에 새로고침하세요.
pl: Połączenie zakończyło się, zanim aplikacja komputerowa potwierdziła zmianę. Odśwież przed ponowną próbą.
pt_br: A conexão terminou antes da confirmação da alteração. Atualize antes de tentar novamente.
ru: Соединение прервалось до подтверждения изменения. Обновите данные перед повторной попыткой.
tr: Masaüstü değişikliği onaylamadan bağlantı kesildi. Yeniden denemeden önce yenileyin.
uk: З’єднання завершилося до підтвердження зміни. Оновіть дані перед повторною спробою.
vi: Kết nối đã kết thúc trước khi ứng dụng máy tính xác nhận thay đổi. Hãy làm mới trước khi thử lại.
zh_hans: 桌面端确认更改前连接已结束。重试前请先刷新。

# rich_chat_requests_title
source: Agent request
de: Agentenanfrage
es: Solicitud del agente
fr: Demande de l’agent
ja: エージェントからのリクエスト
ko: 에이전트 요청
pl: Prośba agenta
pt_br: Solicitação do agente
ru: Запрос агента
tr: Aracı isteği
uk: Запит агента
vi: Yêu cầu của tác nhân
zh_hans: 代理请求

# rich_chat_restore_checkpoint_message
source: Files in the project will be restored to this checkpoint. Later conversation messages are not removed.
de: Die Projektdateien werden auf diesen Prüfpunkt zurückgesetzt. Spätere Nachrichten werden nicht entfernt.
es: Los archivos del proyecto se restaurarán a este punto de control. Los mensajes posteriores no se eliminarán.
fr: Les fichiers du projet seront restaurés à ce point de contrôle. Les messages ultérieurs ne seront pas supprimés.
ja: プロジェクトのファイルをこのチェックポイントに復元します。後の会話メッセージは削除されません。
ko: 프로젝트 파일을 이 체크포인트로 복원합니다. 이후 대화 메시지는 삭제되지 않습니다.
pl: Pliki w projekcie zostaną przywrócone do tego punktu kontrolnego. Późniejsze wiadomości w rozmowie nie zostaną usunięte.
pt_br: Os arquivos do projeto serão restaurados para este ponto de controle. As mensagens posteriores não serão removidas.
ru: Файлы проекта будут восстановлены до этой точки. Последующие сообщения не удалятся.
tr: Projedeki dosyalar bu kontrol noktasına geri yüklenecek. Daha sonraki konuşma mesajları kaldırılmayacak.
uk: Файли проєкту буде відновлено до цієї точки. Пізніші повідомлення не буде видалено.
vi: Các tệp trong dự án sẽ được khôi phục về điểm kiểm tra này. Những tin nhắn sau đó trong cuộc trò chuyện sẽ không bị xóa.
zh_hans: 项目文件将恢复到此检查点。之后的对话消息不会被删除。

# rich_chat_restore_checkpoint_title
source: Restore checkpoint files?
de: Prüfpunktdateien wiederherstellen?
es: ¿Restaurar los archivos del punto de control?
fr: Restaurer les fichiers du point de contrôle ?
ja: チェックポイントのファイルを復元しますか？
ko: 체크포인트 파일을 복원할까요?
pl: Przywrócić pliki z punktu kontrolnego?
pt_br: Restaurar os arquivos do ponto de controle?
ru: Восстановить файлы контрольной точки?
tr: Kontrol noktası dosyaları geri yüklensin mi?
uk: Відновити файли контрольної точки?
vi: Khôi phục các tệp tại điểm kiểm tra?
zh_hans: 恢复检查点文件？

# rich_chat_restore_files
source: Restore files
de: Dateien wiederherstellen
es: Restaurar archivos
fr: Restaurer les fichiers
ja: ファイルを復元
ko: 파일 복원
pl: Przywróć pliki
pt_br: Restaurar arquivos
ru: Восстановить файлы
tr: Dosyaları geri yükle
uk: Відновити файли
vi: Khôi phục tệp
zh_hans: 恢复文件

# rich_chat_resume_goal
source: Resume goal
de: Ziel fortsetzen
es: Reanudar objetivo
fr: Reprendre l’objectif
ja: 目標を再開
ko: 목표 재개
pl: Wznów cel
pt_br: Retomar meta
ru: Продолжить цель
tr: Hedefi sürdür
uk: Продовжити ціль
vi: Tiếp tục mục tiêu
zh_hans: 继续目标

# rich_chat_retry
source: Try Again
de: Erneut versuchen
es: Intentar de nuevo
fr: Réessayer
ja: 再試行
ko: 다시 시도
pl: Spróbuj ponownie
pt_br: Tentar novamente
ru: Повторить
tr: Yeniden Dene
uk: Спробувати ще раз
vi: Thử lại
zh_hans: 重试

# rich_chat_rollback
source: Roll back
de: Zurücksetzen
es: Retroceder
fr: Revenir
ja: 戻す
ko: 되돌리기
pl: Cofnij
pt_br: Reverter
ru: Откатить
tr: Geri al
uk: Відкотити
vi: Quay lại
zh_hans: 回退

# rich_chat_rollback_message
source: The provider conversation will move back one completed turn. Refresh before continuing.
de: Die Anbieterunterhaltung wird um eine abgeschlossene Runde zurückgesetzt. Aktualisiere vor dem Fortfahren.
es: La conversación del proveedor retrocederá un turno completado. Actualiza antes de continuar.
fr: La conversation du fournisseur reculera d’un tour terminé. Actualisez avant de continuer.
ja: プロバイダーの会話を完了済みの 1 ターン分戻します。続行する前に更新してください。
ko: 공급자 대화를 완료된 한 턴만큼 되돌립니다. 계속하기 전에 새로고침하세요.
pl: Rozmowa dostawcy zostanie cofnięta o jedną ukończoną turę. Odśwież przed kontynuowaniem.
pt_br: A conversa do provedor voltará um turno concluído. Atualize antes de continuar.
ru: Разговор провайдера вернётся на один завершённый ход. Обновите данные перед продолжением.
tr: Sağlayıcı konuşması tamamlanmış bir tur geri alınacak. Devam etmeden önce yenileyin.
uk: Розмова провайдера повернеться на один завершений хід. Оновіть дані перед продовженням.
vi: Cuộc trò chuyện của nhà cung cấp sẽ quay lại một lượt đã hoàn tất. Hãy làm mới trước khi tiếp tục.
zh_hans: 提供方对话将回退一个已完成轮次。继续前请刷新。

# rich_chat_rollback_one_turn
source: Roll back one turn
de: Eine Runde zurücksetzen
es: Retroceder un turno
fr: Revenir d’un tour
ja: 1 ターン戻す
ko: 한 턴 되돌리기
pl: Cofnij o jedną turę
pt_br: Reverter um turno
ru: Откатить один ход
tr: Bir tur geri al
uk: Відкотити один хід
vi: Quay lại một lượt
zh_hans: 回退一轮

# rich_chat_rollback_title
source: Roll back one turn?
de: Eine Runde zurücksetzen?
es: ¿Retroceder un turno?
fr: Revenir d’un tour ?
ja: 1 ターン戻しますか？
ko: 한 턴 되돌릴까요?
pl: Cofnąć o jedną turę?
pt_br: Reverter um turno?
ru: Откатить один ход?
tr: Bir tur geri alınsın mı?
uk: Відкотити один хід?
vi: Quay lại một lượt?
zh_hans: 回退一轮？

# rich_chat_save
source: Save
de: Speichern
es: Guardar
fr: Enregistrer
ja: 保存
ko: 저장
pl: Zapisz
pt_br: Salvar
ru: Сохранить
tr: Kaydet
uk: Зберегти
vi: Lưu
zh_hans: 保存

# rich_chat_send_message
source: Send message
de: Nachricht senden
es: Enviar mensaje
fr: Envoyer le message
ja: メッセージを送信
ko: 메시지 보내기
pl: Wyślij wiadomość
pt_br: Enviar mensagem
ru: Отправить сообщение
tr: Mesaj gönder
uk: Надіслати повідомлення
vi: Gửi tin nhắn
zh_hans: 发送消息

# rich_chat_session_not_ready
source: Wait for the desktop session to finish loading.
de: Warte, bis die Desktop-Sitzung vollständig geladen ist.
es: Espera a que termine de cargarse la sesión del escritorio.
fr: Attendez la fin du chargement de la session de l’ordinateur.
ja: デスクトップセッションの読み込みが完了するまでお待ちください。
ko: 데스크톱 세션 로드가 끝날 때까지 기다리세요.
pl: Poczekaj, aż sesja aplikacji komputerowej zakończy ładowanie.
pt_br: Aguarde o término do carregamento da sessão do computador.
ru: Дождитесь загрузки сессии компьютера.
tr: Masaüstü oturumunun yüklenmesinin tamamlanmasını bekleyin.
uk: Зачекайте, доки сеанс комп’ютера завантажиться.
vi: Hãy chờ phiên ứng dụng máy tính tải xong.
zh_hans: 请等待桌面端会话加载完成。

# rich_chat_show_details
source: Show details
de: Details anzeigen
es: Mostrar detalles
fr: Afficher les détails
ja: 詳細を表示
ko: 세부정보 표시
pl: Pokaż szczegóły
pt_br: Mostrar detalhes
ru: Показать подробности
tr: Ayrıntıları göster
uk: Показати подробиці
vi: Hiện chi tiết
zh_hans: 显示详情

# rich_chat_steer_message
source: Follow-up instruction
de: Folgeanweisung
es: Instrucción de seguimiento
fr: Instruction de suivi
ja: フォローアップ指示
ko: 후속 지시
pl: Instrukcja uzupełniająca
pt_br: Instrução de acompanhamento
ru: Дополнительная инструкция
tr: Takip talimatı
uk: Подальша інструкція
vi: Chỉ dẫn tiếp theo
zh_hans: 后续指示

# rich_chat_stop_generation
source: Stop generation
de: Generierung stoppen
es: Detener generación
fr: Arrêter la génération
ja: 生成を停止
ko: 생성 중지
pl: Zatrzymaj generowanie
pt_br: Interromper geração
ru: Остановить генерацию
tr: Oluşturmayı durdur
uk: Зупинити створення
vi: Dừng tạo nội dung
zh_hans: 停止生成

# rich_chat_submit
source: Submit
de: Absenden
es: Enviar
fr: Envoyer
ja: 送信
ko: 제출
pl: Wyślij
pt_br: Enviar
ru: Отправить
tr: Gönder
uk: Надіслати
vi: Gửi
zh_hans: 提交

# rich_chat_terminal_deferred_message
source: Interactive terminal streaming is not available in this native build yet. Open this conversation on the desktop.
de: Interaktives Terminal-Streaming ist in diesem nativen Build noch nicht verfügbar. Öffne diese Unterhaltung auf dem Desktop.
es: La transmisión interactiva del terminal aún no está disponible en esta compilación nativa. Abre esta conversación en el escritorio.
fr: La diffusion interactive du terminal n’est pas encore disponible dans cette version native. Ouvrez cette conversation sur l’ordinateur.
ja: このネイティブビルドでは、対話型ターミナルストリーミングをまだ利用できません。デスクトップでこの会話を開いてください。
ko: 이 네이티브 빌드에서는 대화형 터미널 스트리밍을 아직 사용할 수 없습니다. 데스크톱에서 이 대화를 여세요.
pl: Interaktywne przesyłanie strumieniowe terminala nie jest jeszcze dostępne w tej natywnej wersji. Otwórz tę rozmowę w aplikacji komputerowej.
pt_br: A transmissão interativa do terminal ainda não está disponível nesta compilação nativa. Abra esta conversa no computador.
ru: Интерактивная трансляция терминала пока недоступна в этой нативной сборке. Откройте разговор на компьютере.
tr: Etkileşimli terminal akışı bu yerel sürümde henüz kullanılamıyor. Bu konuşmayı masaüstünde açın.
uk: Інтерактивна трансляція термінала ще недоступна в цій нативній збірці. Відкрийте розмову на комп’ютері.
vi: Tính năng truyền phát đầu cuối tương tác chưa có trong bản dựng gốc này. Hãy mở cuộc trò chuyện này trên ứng dụng máy tính.
zh_hans: 此原生版本暂不支持交互式终端流。请在桌面端打开此对话。

# rich_chat_terminal_deferred_title
source: Terminal conversation
de: Terminal-Unterhaltung
es: Conversación de terminal
fr: Conversation de terminal
ja: ターミナル会話
ko: 터미널 대화
pl: Rozmowa terminalowa
pt_br: Conversa de terminal
ru: Разговор в терминале
tr: Terminal konuşması
uk: Розмова в терміналі
vi: Cuộc trò chuyện đầu cuối
zh_hans: 终端对话

# rich_chat_timeline_description
source: Rich conversation timeline
de: Verlauf der Rich-Unterhaltung
es: Cronología de la conversación enriquecida
fr: Chronologie de la conversation enrichie
ja: リッチ会話のタイムライン
ko: 리치 대화 타임라인
pl: Oś czasu rozbudowanej rozmowy
pt_br: Linha do tempo da conversa avançada
ru: Хронология расширенного разговора
tr: Zengin konuşma zaman çizelgesi
uk: Хронологія розширеної розмови
vi: Dòng thời gian trò chuyện phong phú
zh_hans: 富对话时间线

# rich_chat_truncate_accessibility
source: Delete every item after this one
de: Alle Einträge nach diesem löschen
es: Eliminar todos los elementos posteriores a este
fr: Supprimer tous les éléments suivants
ja: この項目より後のすべての項目を削除
ko: 이 항목 이후의 모든 항목 삭제
pl: Usuń wszystkie elementy po tym
pt_br: Excluir todos os itens após este
ru: Удалить все элементы после этого
tr: Bundan sonraki tüm ögeleri sil
uk: Видалити всі елементи після цього
vi: Xóa mọi mục sau mục này
zh_hans: 删除此项之后的所有条目

# rich_chat_truncate_action
source: Delete From Here
de: Ab hier löschen
es: Eliminar desde aquí
fr: Supprimer à partir d’ici
ja: ここから削除
ko: 여기부터 삭제
pl: Usuń od tego miejsca
pt_br: Excluir a partir daqui
ru: Удалить отсюда
tr: Buradan itibaren sil
uk: Видалити звідси
vi: Xóa từ đây
zh_hans: 从此处开始删除

# rich_chat_truncate_confirm_button
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
pl: Usuń
pt_br: Excluir
ru: Удалить
tr: Sil
uk: Видалити
vi: Xóa
zh_hans: 删除

# rich_chat_truncate_confirm_message
source: The desktop removes every later item from this thread’s runtime. This cannot be undone.
de: Der Desktop entfernt alle späteren Einträge aus der Laufzeit dieses Threads. Das kann nicht rückgängig gemacht werden.
es: El escritorio quita todos los elementos posteriores del entorno de ejecución de este hilo. No se puede deshacer.
fr: Le bureau retire tous les éléments suivants de l’exécution de ce fil. Cette action est irréversible.
ja: デスクトップはこのスレッドのランタイムから以降のすべての項目を削除します。この操作は取り消せません。
ko: 데스크톱이 이 스레드 런타임에서 이후의 모든 항목을 제거합니다. 되돌릴 수 없습니다.
pl: Komputer usunie wszystkie późniejsze elementy ze środowiska uruchomieniowego tego wątku. Tej operacji nie można cofnąć.
pt_br: O desktop remove todos os itens seguintes do runtime desta conversa. Isso não pode ser desfeito.
ru: Компьютер удалит все последующие элементы из среды выполнения этой ветки. Отменить это нельзя.
tr: Masaüstü, bu ileti dizisinin çalışma zamanından sonraki tüm ögeleri kaldırır. Bu işlem geri alınamaz.
uk: Комп’ютер вилучить усі подальші елементи із середовища виконання цієї гілки. Скасувати це неможливо.
vi: Máy tính sẽ gỡ mọi mục sau đó khỏi môi trường chạy của luồng này. Không thể hoàn tác.
zh_hans: 桌面端会从此线程的运行时中移除其后的所有条目。此操作无法撤销。

# rich_chat_truncate_confirm_title
source: Delete everything after this item?
de: Alles nach diesem Eintrag löschen?
es: ¿Eliminar todo lo posterior a este elemento?
fr: Supprimer tout ce qui suit cet élément ?
ja: この項目より後をすべて削除しますか？
ko: 이 항목 이후를 모두 삭제할까요?
pl: Usunąć wszystko po tym elemencie?
pt_br: Excluir tudo após este item?
ru: Удалить всё после этого элемента?
tr: Bu ögeden sonraki her şey silinsin mi?
uk: Видалити все після цього елемента?
vi: Xóa mọi thứ sau mục này?
zh_hans: 要删除此项之后的所有内容吗？

# rich_chat_turn_checkpoint
source: Turn checkpoint
de: Runden-Prüfpunkt
es: Punto de control del turno
fr: Point de contrôle du tour
ja: ターンのチェックポイント
ko: 턴 체크포인트
pl: Punkt kontrolny tury
pt_br: Ponto de controle do turno
ru: Контрольная точка хода
tr: Tur kontrol noktası
uk: Контрольна точка ходу
vi: Điểm kiểm tra lượt
zh_hans: 轮次检查点

# rich_chat_web_search
source: Web search
de: Websuche
es: Búsqueda web
fr: Recherche web
ja: ウェブ検索
ko: 웹 검색
pl: Wyszukiwanie w sieci
pt_br: Pesquisa na web
ru: Поиск в интернете
tr: Web araması
uk: Пошук в інтернеті
vi: Tìm kiếm trên web
zh_hans: 网页搜索

# rich_chat_working
source: Working…
de: Wird ausgeführt…
es: Trabajando…
fr: Traitement en cours…
ja: 処理中…
ko: 작업 중…
pl: Praca w toku…
pt_br: Trabalhando…
ru: Выполняется…
tr: Çalışıyor…
uk: Виконується…
vi: Đang làm việc…
zh_hans: 处理中…

# rich_chat_you
source: You
de: Du
es: Tú
fr: Vous
ja: あなた
ko: 나
pl: Ty
pt_br: Você
ru: Вы
tr: Siz
uk: Ви
vi: Bạn
zh_hans: 你

# home.accessibility.project
source: %@, threads: %lld
es: %@, hilos: %lld
fr: %@, fils : %lld
ja: %@、スレッド: %lld
ko: %@, 스레드: %lld
pl: %@, wątki: %lld
pt_br: %@, conversas: %lld
ru: %@, ветки: %lld
tr: %@, ileti dizileri: %lld
uk: %@, гілки: %lld
vi: %@, luồng: %lld
zh_hans: %@，线程：%lld

# home.label.agent
source: Agent
es: Agente
ja: エージェント
ko: 에이전트
pt_br: Agente
ru: Агент
tr: Aracı
uk: Агент
vi: Tác nhân
zh_hans: 智能体

# home.project.threadCount
source: Threads: %lld
es: Hilos: %lld
fr: Fils : %lld
ja: スレッド: %lld
ko: 스레드: %lld
pl: Wątki: %lld
pt_br: Conversas: %lld
ru: Ветки: %lld
tr: İleti dizileri: %lld
uk: Гілки: %lld
vi: Luồng: %lld
zh_hans: 线程：%lld

# home.worktree.accessibility
source: %@, threads: %lld
es: %@, hilos: %lld
fr: %@, fils : %lld
ja: %@、スレッド数：%lld
ko: %@, 스레드: %lld
pl: %@, wątki: %lld
ru: %@, веток: %lld
tr: %@, iş parçacığı: %lld
uk: %@, гілок: %lld
vi: %@, luồng: %lld
zh_hans: %@，线程数：%lld

# projects.field.repositoryURL
source: Repository URL
es: URL del repositorio
fr: URL du dépôt
ja: リポジトリURL
ko: 저장소 URL
pl: Adres URL repozytorium
pt_br: URL do repositório
ru: URL репозитория
tr: Depo URL’si
uk: URL-адреса репозиторію
vi: URL kho lưu trữ
zh_hans: 仓库 URL
